In [1]:
import pandas as pd

In [2]:
dict1 = {'Name': ['Priyang', 'Aadhya', 'Kashish', 'Ashish', 'Parshv', 'Mittal', 'Archana'], 
         'Marks': [98, 89, 87, 99, 90, 83, 95],
         'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Male', 'Female']
        }

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Kashish     87  Female
3   Ashish     99    Male
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     95  Female

In [5]:
# displaying top 3 rows.
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Kashish     87  Female

In [6]:
# displaying last 3 rows.
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     95  Female

In [8]:
# determining the shape of the dataset.
df.shape

(7, 3)

<p style="color: green; font-size: 18px"><code>shape</code> is a <code>attribute</code> not a method.</p>

In [10]:
# Get overall statistics about the dataframe.
df.describe()

           Marks
count   7.000000
mean   91.571429
std     5.940178
min    83.000000
25%    88.000000
50%    90.000000
75%    96.500000
max    99.000000

<p style="color: green; font-size: 18px;">By default, <code>describe()</code> methods, gives the statistical information about the <code>numerical</code> columns only.</p>

### To get the description about all columns.

In [20]:
df.describe(include='all')

           Name      Marks Gender
count         7   7.000000      7
unique        7        NaN      2
top     Priyang        NaN   Male
freq          1        NaN      4
mean        NaN  91.571429    NaN
std         NaN   5.940178    NaN
min         NaN  83.000000    NaN
25%         NaN  88.000000    NaN
50%         NaN  90.000000    NaN
75%         NaN  96.500000    NaN
max         NaN  99.000000    NaN

In [11]:
# Getting the information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [12]:
# Checking for the null values.
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [13]:
# Checking for null values count.
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

<p style="color: green; font-size: 18px">The output will be returned column wise.</p>

In [14]:
# checking for null values count rows wise.
df.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [19]:
# Find the unique values from the "Gender" column.
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [21]:
# Find the number of unique values from the "Gender" column.
df['Gender'].nunique()

2

In [22]:
# Display count of unique values in Gender column.
df['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

In [26]:
# Find total number of students having marks between 90 to 100(inclusive) without using "between()" method.
len(df[(df['Marks']>=90) & (df['Marks']<=100)])

4

In [27]:
# using between method.
df['Marks'].between(90, 100) # both the values are inclusive.

0     True
1    False
2    False
3     True
4     True
5    False
6     True
Name: Marks, dtype: bool

In [28]:
sum(df['Marks'].between(90, 100))

4

In [31]:
# Find Average marks
df['Marks'].mean()

91.57142857142857

# Apply method.

In [32]:
def halfMarks(x):
    return x/2

In [33]:
df['Marks'].apply(halfMarks)

0    49.0
1    44.5
2    43.5
3    49.5
4    45.0
5    41.5
6    47.5
Name: Marks, dtype: float64

### Using lambda function

In [35]:
df['Marks'].apply(lambda x: x/2)

0    49.0
1    44.5
2    43.5
3    49.5
4    45.0
5    41.5
6    47.5
Name: Marks, dtype: float64

In [38]:
# Adding this half marks to the original dataframe.
df['halfMarks'] = df['Marks'].apply(lambda x: x//2)

In [39]:
df

      Name  Marks  Gender  halfMarks
0  Priyang     98    Male         49
1   Aadhya     89  Female         44
2  Kashish     87  Female         43
3   Ashish     99    Male         49
4   Parshv     90    Male         45
5   Mittal     83    Male         41
6  Archana     95  Female         47

In [40]:
# Getting the length of each string present in Name column.
df['Name'].apply(len)

0    7
1    6
2    7
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# Map Function
We can map values to any other values.
such as mapping integers to any string values</br>
We can use this for `encoding` purpose.

In [43]:
df['Gender'] = df['Gender'].map({'Male': 1, 'Female': 0})

In [44]:
df

      Name  Marks  Gender  halfMarks
0  Priyang     98       1         49
1   Aadhya     89       0         44
2  Kashish     87       0         43
3   Ashish     99       1         49
4   Parshv     90       1         45
5   Mittal     83       1         41
6  Archana     95       0         47

In [45]:
df['Gender'] = df['Gender'].map({1: 'Male', 0: 'Female'})

In [46]:
df

      Name  Marks  Gender  halfMarks
0  Priyang     98    Male         49
1   Aadhya     89  Female         44
2  Kashish     87  Female         43
3   Ashish     99    Male         49
4   Parshv     90    Male         45
5   Mittal     83    Male         41
6  Archana     95  Female         47

In [49]:
# drop the column(s)
df.drop('halfMarks', axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Kashish     87  Female
3   Ashish     99    Male
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     95  Female

In [50]:
df

      Name  Marks  Gender  halfMarks
0  Priyang     98    Male         49
1   Aadhya     89  Female         44
2  Kashish     87  Female         43
3   Ashish     99    Male         49
4   Parshv     90    Male         45
5   Mittal     83    Male         41
6  Archana     95  Female         47

In [52]:
df.drop('halfMarks', axis=1, inplace=True)

In [53]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Kashish     87  Female
3   Ashish     99    Male
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     95  Female

In [55]:
# print the name of the columns.
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [58]:
# Sort the DataFrame as per marks column.
df.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
3   Ashish     99    Male
0  Priyang     98    Male
6  Archana     95  Female
4   Parshv     90    Male
1   Aadhya     89  Female
2  Kashish     87  Female
5   Mittal     83    Male

In [71]:
# Display name and marks of female students.
df[df['Gender']=='Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2  Kashish     87
6  Archana     95

## isin() method

In [73]:
df[df['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2  Kashish     87  Female
6  Archana     95  Female

In [74]:
df[df['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2  Kashish     87
6  Archana     95